package ch02_variable;

public class VariableName {
    //개발 시, 명명법

    //프로젝트명은 앞에 대문자 사용
    //하나 이상의 단어가 포함되어 있는 경우 다음 단어의 앞글자는 대문자로 작성(ex : MyProject)

    //패키지명은 전부 소문자
    //하나 이상의 단어가 포함되어 있는 경우 언더바를 추가(ex : ch01_start)

    //클래스명은 프로젝트 명명법과 동일

    //변수명 짓기
    //카멜(Camel) 방식 사용(95%)
    //첫 단어는 소문자로 시작, 하나 이상의 단어가 포함된다면 다음 단어는 대문자로 시작(ex : todayIsHappy)

    //헝가리안 방식
    //변수명 앞에 변수타입을 적어놓는 방식(ex : strName, intMoney)

    //변수일 때는 변수명 앞에 v_를 붙임(ex : v_string)
    //함수일 때는 함수명 앞에 f를 붙임
    //파라미터일 때는 파라미터명 앞에 p_를 붙임
    //명시적이기에 눈으로 보았을 때 즉각적으로 이해가 되며 코드를 이해하고 해석하는데 용이

    //함수명 규칙은 변수명와 동일한 카멜식

    //변수명 주의사항
    //1. 이미 한 번 선언된 변수명은 중복 선언 불가능
    //2. 변수명에 공백 또는 특수문자 사용 불가
    //3. 영어 대소문자 구분한다(변수 lol과 LoL은 다른 변수명으로 취급)
    //4. 숫자를 변수명에 사용할 수 있으나 변수명 앞에 숫자를 쓸 순 없다.식
    //5. 변수명의 글자 수 제한 없음.(변수명을 길게 지어도 무방)
    //6. 변수명을 길게 지을수록 의미부여 명확히 가능
    //7. 예약어 사용 불가

    //상수명 짓기
    //단어 전부 대문자를 사용하며 단어 사이에 언더바 사용(ex : NEXT_IT_ADDRESS) - 스네이크 방식





}
